{
  "title": "the seasons are out of order",
  "dek": "but anyway here's another one",
  "body": "Six. It’s April, and the threat of winter, while not gone, is mostly a point of reference for enjoying the new sun on days when it’s warm, when it’s possible to be outside for longer than five minutes without wanting to seize back up into your shell of blankets and sweaters. Now you can walk on the sidewalk without fear of slipping on invisible ice and breaking your tailbone, putting you out of work for weeks when funds are scarce. I’ve allowed a number of spiders to live in my apartment, mostly because I’m bored and lazy to kill them, but also because I recognize, as the temperatures warm--Maine is perhaps buggier than any other place I’ve lived. My style is not to kill everything as a control mechanism. I am for antibiotics under the right circumstances but in general they freak me out because they kill everything, all the biotics, that’s good and bad biotics, which creates a vacuum in the ecosystem, which facilitates the rise of god knows what; if we have paid attention to history, and this is not to overly dramatize the discourse, but if we have paid attention, we know what kinds of horrors vacuums can give way to, under all kinds of circumstances. If I allow spiders to live in my apartment, they will diminish the bug population, most of which is more interested in fucking with me than the actual spiders. There are mornings spent in the hobbit hole, drinking beer or coffee, smoking joints or the occasional cigarette while trying to compose the weather report, a diary entry of sorts mostly comprised of deep, internal secrets I would never share with you, viewer, listener, if you are. Thinking about this. That I have to preserve what is alive left in me. That I can’t keep drinking and killing everything, demons and the spark, if it’s still left. Then there are the evenings, plugging away in the restaurant, taking adderall in order to warrior through the thirteen hour shifts, with glee, even, but I shouldn’t be, I shouldn’t have glee for twelve hours a day, and for that reason, too, I’m killing everything. It’s like my chemical submission to stockholm syndrome, the superhuman drugged workhorse, wrapped around the coin of my oppressors and their Praetorian drones, the forces at work. As it is, the serotonin levels in my brain, at least as I perceive them, fluctuate like the climate-change-y weather we’ve been experiencing. I can hardly complete my reports before it occurs to me to begin a new one. There is a greenhouse out back, built by the landlords and used now for storage, mostly of lumber and unused gardening supplies, chicken feed, a raised bed. The doors are open at all times and the walls are without insulation. My guess is that annuals would enjoy conditions 8-10 degrees higher in this microclime although the doors would have to close and a fan be installed, somehow, come September when I imagine the temperatures plummet in preparation for an early winter. Or else winter is an entity that arrives of its own volition, and each moment of weather exists in isolation, adjacent though not necessarily in communion with the next. What happens in October is no bearing on January, the cumulative effect turning out to have been an illusion of sorts. It’s a controversial suggestion. I doubt it to be true. And anyhow, I wouldn’t have the time or money or energy to insulate this greenhouse, especially when I plan to exit the tenancy once the year is up. So, annuals it would be. I procured two starts, one indica and one sativa, from my good friends who lived and grew a half hour away. From them I also received favas, for the ganja’s early nitrogen needs, tomatoes, peppers, eggplants and broccolini, which did well for quite a while but ended up getting ravaged by slugs. Against this threat I was powerless; I worked fifty hours a week and lacked the cruel streak to kill or deter even pests. I also planted radish seeds, cilantro, basil, cabbage, rutabaga, and a giant purple and white bean variety Ambria and Daniel had procured during their time in Ghana and smuggled back, one that was said to climb giant tree trunks in its native climate and fruit expansively, sometimes lasting for years. I hoped to overwinter these, allowing them to wind around my apartment until it was time to leave, at which point I would trim them down to their most essential stalks and hoped they survived the transplant to a new chapter of my life. I worked and worked and met almost no one new. My sex went dry and I planted as many things in my spare time, when I wasn’t reporting or cooking, as I possibly could. I planted and planted until I ran out of plots, pots, and available soil. I planted compulsively, sometimes without rhyme or reason, if only to see things grow without the hope for much yield. I planted until it seemed almost like a drug, though when I checked to see whether or not it was unhealthy, I found it wasn’t. Sometimes you can’t have too much of a good thing.",
  "hidden": false,
  "date": "2019-04-08T17:04:00.000Z"
}