{
  "title": "Wiscasset",
  "body": "A mile out from Wiscasset, I am stopped at a gas station. Time here seems to have vaulted ahead certain aspects of the landscape and convenience store, such as the more and more modern houses, eroded areas, the ATM and credit card machines, the touch-screen kiosk for ordering sandwiches, while other aspects, namely the gas pumps, remain squarely in the past. They must be relics from the 1950s or 60s, and when I go inside to pay, the cashier thanks me for not trying to stick my credit card into the machine. \n\n\n\n> “People have done that?” I ask, for some reason bothering her for the receipt. \n\n\n\n> “Sure. Even if it doesn’t have a slot, they try to find one.” \n\n\n\n> “Tourists, usually?” \n\n\n\n> “Always.” \n\n\n\n> “How do you like the tourists? Do you mind them?” \n\n\n\n> “Sometimes. Not always. We need them. It can be hard to remember if you like them when you need their business.” \n\n\n\nIt occurs to me that tourism is the Faustian bargain locals here must make in order to live amongst such striking inlets, away from the thick of the world and in the radiant, unseen beauty of mooses, foxes, minks, large cats, and thousands of birds. The pines, too, and after the long, Maine winter, of which I’ve only had a taste, which can still seem romantic to me with its dreamy near-constant snowfall, nebulae of snow and sleet and ice along the hillsides, constantly melting and shifting and freezing, again, though never truly, deeply melting, I would imagine it’s good to see people again, even if you’re stuck behind them with their blinker on going 30 in a 50, or being filibustered by their masses trying to do basic things like purchase gas and go to the grocery store.  \n\n\n\nSummer here is an ever-looming boon-apocalypse, a much talked about season and event, which I had heard about multiple times during my first three interactions with Mainers, particularly employers offering perspective on the year’s arc.  \n\n\n\n> “God, just wait until summer.” \n\n\n\n> “You’ll see, when summer hits, it’s nothing like this. Shit’s crazy.” \n\n\n\n> “By the end of summer, you’re going to want to pound your fists against the wall. You’re not going to want to talk to anyone after work. You won’t even want a beer when the night’s through.” \n\n\n\nI got tired of hearing about it. Summer. To be honest, with all the hype, I concluded that it was like any movie, new restaurant, “good book” that had crossed through the grapevine--usually a fraction of whatever exaggeration it was made out to be. \n\n\n\nI drove to a friend’s house, Ambria and Daniel and Craig, all met through a dairy farm job  we worked in New Jersey, before coming here. They grew marijuana in an insulated garage, which I’d had a small hand in helping them build. In the dead of winter. It was overwhelming and displacing to see such green, to smell and feel fertility wafts in a small, humid garage resembling the inner lining of a tinfoil baked potato. We had become close friends working on a farm in the Delaware valley, and this night we took 40mg of Adderall, each, killed three bottles of wine--four of us--and played several rounds of cribbage. Afterwards we shut down the ganja room and wandered around outside with a joint, much to our paranoid chagrin that ticks exist even in winter, here. Part of me joked that Adderall was the reason I’d moved to Maine. But in the morning, when I woke up on the couch in the AirBnB, a strange novel parted over my half-exposed belly, it still seemed like a good idea, moving for good to the place they called Vacationland.",
  "hidden": false,
  "date": "2019-08-04T17:03:00.000Z"
}