{
  "title": "Eggplant harvest",
  "dek": "subject line: spam",
  "body": "Eggplant harvest beginning. Working too much. Today I drove to Ambria and Daniel and Craig’s across three or four different climates, sunny in Rockland and a storm front, or the beginnings of one, moving upstate and inland. \n\nIntense winds brought millions of late-summer leaves to life as the foreground darkened, though the sun still glinted sharply off the water, blinding me to a family of ducks I was attempting to spy on. In the passenger’s seat was a shopping bag full of eggplants, tomatoes, peppers, and basil from the garden, a bottle of wine and a six-pack, which I was sure wouldn’t be enough, but they will ravage you at the co-op with prices, and I had gone there for a nice piece of meat, not to be shaken down for $80 for a couple six-packs and a modest-at-best dinner. \n\nI arrived in a bit of a funk, having heard first a Dvorak orchestral piece that intrigued me, followed by a choral arrangement that made me cry, followed by another orchestral with a solo violin, someone with a jangly-weepy style, like Itzak Pearlman on the Schindler’s List soundtrack. My mother used to play a solo piano version of the main theme from that movie, and as a kid, it made me want to curl up and cry under the overhanging arm of the couch, or sometimes somewhat dramatically in a ball beneath the grand piano itself. The sadness of it was overwhelming. Other pieces made my cry, too, but this one stands out in memory. \n\nI’d forgotten I wasn’t headed to work, the route to the friends’ house being the same for the first five minutes of the drive, and turned down what I call the road of threadbare pastures, because there are several along it with too many sweet, undernourished looking cows overgrazing and choking down bad looking hay. \n\nI turned around, narrowly skirting a view of the restaurant as I returned to route 17, along which the once infinite lilacs drooped, dead, replaced with jewelweed flowers. I couldn’t resist blaring the last violin piece, an obvious welling mechanism, which brought to mind all that I’ve lost and not just to the hours spent making bones in the restaurant. I wept more than I have in several months if you don’t count the drunken times, and I wasn’t more than a little stoned, so it all felt good. I got to their house, snapped out of it and said my hellos, charred the eggplants in the skillet--isn’t it amazing that this vegetable can be a vessel for its own cooking--and ground them up into baba ganoush with lots of roasted garlic. \n\nNow, here I am, powering through another report, despite the aching of my hands, which have used knife and tong to rip through countless square inches of vegetable, meat, stirring, pounding, rolling, burning. \n\nThe pioneer locusts out the living room window wave in the wind, half egging, half deterring me, I think, I affect. Clouds and wind move forward like a sweet, army, the sun showing through at each brief break in rank.",
  "hidden": true,
  "date": "2019-08-11T17:05:00.000Z"
}