{
  "title": "End of summer weather report",
  "dek": "Poseur Meteorologist",
  "body": "Woke this morning to something wrong. A feeling somewhere between belly and head. Nausea converged, mute and ominous like cumulonimbus before they break out into thunder and rain, on the space three inches above the surface of my stomach, and vibrated in the abstract before entering as a thought in my legs, which carried me to the bathroom, and my hands, which gripped the toilet bowl like a steering wheel--tighter than necessary. The retching was awful, like nothing would ever be good again, until it was over and I was wiping my mouth, which didn’t make it good again, though I’d shaken that terminal feeling. Above the landlord’s daughter, Scarlet, began practicing the violin. Pachabel’s Canon, played severely out of tune. I drank some water and went back to bed. Got woken up, once the violin stopped and the stomping ensued. I opened a beer, drank some. Went outside, saw my rutabaga had been ravaged by slugs, did some quick research and learned the solution was between my fingertips. Ten minutes later I was rigging a beer trap for slugs, after googling ‘how to repel slugs’. Then I didn’t know what else to forecast, the weather outside was nondescript, a blanket of white coals across the morning sky, and I was feeling goopy and sad so I just said--Cut cut cut. \n\n\n\n*True Meteorologist, barely able to resist breaking the fourth wall*\n\n---\n\n#### Here is the true weather: \nToday will be cooler than yesterday, with moisture moving up the state’s northeast corridor before diffusing out, with some lovely dry Canadian polar winds coming in lieu later in the week. About sixty-eight degrees with humidity dropping well below the fifty-percent mark. The afternoon will be sunny with a chance of showers and scattered thunderstorms in the early evening as clouds converge rapidly around a full moon. Unlike previous years, these September nights will resist winter’s omen, displaying warmer than usual temperatures into the upper 60s, while swerving now and then back down as polar winds jaunt up and down like uncertain travelers. A warm front will move in later in the week, shattering the cool spell for the weekend before leveling off back to where the cool winds had last dog-eared the hopes our of brows. Who isn’t weary after summer, though also so at the prospect of a long winter, this time of year? Perhaps we are seeding the clouds with ourselves, as this weather refuses to decide. Cut.",
  "hidden": false,
  "date": "2019-08-28T17:09:00.000Z"
}