{
  "title": "Letter to New Orleans",
  "dek": "",
  "body": "In the same way the ocean bleeds into the sky, in places, when conditions are hazy and pastel, the lines blurred, in Maine along the midcoast the morning shows the same colors as in the evening times. \n\nSure, the mornings are pinker, the evenings bluer, but you hardly notice this while in awe of how similar they are. Hours pass in folds of thunder and salt air, unexpected gulls in leafy deciduous places just off the coast, remembrances of southern airs, of being enfolded in the arms of someone known well, someone with the ability to replace drugs and alcohol. \n\nThe New Orleans bungalow where you stole away with them from everything. You once knew them well. It’s the same as what you do with those vices. This is an unaffected weather report. The fog rolling away, one you thought was sleep, replaced by sun and rain in a three hour period, so that you were sure the nap was three hours, instead of fifteen minutes. The ocean and sky, meeting, one blue. \n\nRain falls like white noise as you drive a half hour, at 12:44am. Lightning illuminates the sky across the valley, absence of color, unseen fog, Nine Inch Nails on the radio. Very emo of me. Rain-drenched horse on the side of the road, within threadbare pen. \n\nThree hours before work, here and there, infinite one hour and headlong two, drunk and forgetting it passes, wanting to be swallowed by the last fifteen minutes. *Is a season a moment or a moment a season?* A basic problem--I forgot. I get on the bike in the morning. Perfidious rims. I get off. A dog chases me. \n\nSimple sentences pass like clouds without meaning. \n\nStirring the risotto, stirring the risotto, an entire purgatory within which I stir the risotto. \n\nGetting so wrapped up in life you forget food exists. You forget food feels good. You forget food makes you forget what’s making you forget food. Stirring, stirring. I came here to not think, or to think away the thinking, though all I can bring to mind now is the weather. \n\nToday I cleared a large patch of tall jewelweed to provide my raised bed with more sunlight access. Drank out of all of the bottles on my floor. Found a few full, unspilled moments. I go to sleep without going to sleep, the shower still undone on my skin, my sweat still pouring down the drain, into the fibers of the bed, joint rolled unsmoked, sweet tune playing on the laptop speakers, half tinny. \n\nI can’t figure out if my life is sad or not. The weather report only shows the weather. Goodnight, goodnight. God friend at night, (Good Friend during the day) used to be my favorite Chinese food in Brooklyn. Is it sad or inadvisable, now, to consider, above all people, including that past love I sometimes miss, to say--I miss God Friend. All I want is too many of their crab rangoons and that radioactive General Tso’s. God, hurt me with that General, General’s. I want to sing its blues.",
  "hidden": false,
  "date": "2019-08-09T17:05:00.000Z"
}