{
  "title": "Letter to Brooklyn",
  "dek": "Later in evening",
  "body": "I have reviewed many weather reports from previous days, in internet videos, and can hardly recall the other events that happened during them. I found them disassociating to watch for long periods of time. I found them calming. With a few, mostly those forecasting the worst and most exciting weather, I could recall the particular day, say, a blizzard took place, and perhaps events connected to the blizzard. Like where I was in the world, and who I got snowed in with. Some of the things we did but none of the things we talked about. Unless it was a fight, but then remembered mostly as ‘fight’ with perhaps ‘vaguely remembered cause’. \n\nI’m shirtless right now and pausing a lot, typing this, because of an endless stream of mosquitos raiding my big warm boddess. Shirt back on. Water, no beer after last. Ok. There was the day of the biggest blizzard of 2016, I was living in Brooklyn with Ej and Ben, two good friends I grew up with, in this basement apartment near the Myrtle-Willoughby JMZ. Gentrifiers, I know. I felt worse and worse about that fact until I left, though I always prioritized my local bodega and grocery stores, and tried to be as respectful (read: in ways, deferential) as I could. \n\n> “To stay or to go, boss?” \n\nOne of the cooks at my favorite corner, Felipe, would ask, whenever I ordered a sandwich late at night. I would side-eye him and smile, eyes red from being high or overworked or both, before giving my answer. \n\nHis brother Hector was a line cook at the downtown restaurant where I ran food. I don’t think we saw Felipe during this particular blizzard, though it was possible as the group and I killed an entire bottle of bourbon on our snow waltz through the neighborhood, in the neighborhood of two-and-a-half to three feet on the ground and still falling, that we passed him, his face veiled from the snow, without noticing. \n\nCars were parked in the middle of the street, wherever they couldn’t keep making it. The subsequent hours of snow piled on their hoods and trunks. Plows crunched and guzzled through where they could, illuminating the snow with flashing red and bright white lights. “It’s like martial law, out here,” EJ said, lighting a spliff as I pulled on the booze as we all trudged down the middle of a normally busy street. \n\nA few nights later I was getting ready to leave for New Jersey, to see the woman with whom I’d begun to have an affair, knowing my Buick would be somewhat buried in snow, though I assumed it would be manageable. Like a true New York City noob I had parked on the side of the road the snow gets plowed to. The car was buried in three feet of iced-over snow. \n\nI looked around, and a miracle arrived in the form of a winter oasis: a shovel discarded in the snow bank on the other side of the sidewalk. I clamored over the ice and picked up the apparatus, shook it--plastic and cracked, at the edge of it. With low hopes I brought it over to the hood, raised my arms and drove the edge into the ice adjacent the right headlight. T\n\nhe shovel skidded off, scratched the hood of my car, and slipped out of my hands. I picked it up and put it back where it was, or where I recalled it had been, on the snowbank just beyond the sidewalk, got in the passenger’s seat of my car, where I’d be less visible from the road, unless a cop drove by, and packed a bowl. I took two hits, wondering how I’d get to see the woman I loved, who was still married, who I wasn’t sure wanted me enough to warrant my bending over backwards to extricate myself from a blizzard three days frozen over. \n\nHalfway through the bowl, I noticed a large man in blue jeans and a long-sleeved shirt, no jacket, waving to me from the road. I waved back, hid my bowl, and stiffened up. I didn’t know what sort of man he was--his nondescriptness almost indicated an undercover cop vibe, and I didn’t want to betray any unconfidence in my decision to sit in the passenger’s seat of a car, possibly mine, at 2am. \n\nHe came over to the window, much to my shock and surreality, and knocked on the window. I got out of the car. “You need some help getting out?” he asked, pointing to the mass of ice separating and also adjoining me with the sidewalk. “Well,” I said. “Say no more. Wait here.” He left me in the road, sprinting on squat legs to an apartment just shy of the next block, disappearing there for almost ten minutes before reemerging, sprinting back down the block. He brought a metal shovel. \n\n“Let me,” he said. \n\n“No, come on, this is enough, let me do it,” I said, trying to take the wooden handle. \n\nHe wouldn’t have it. \n\nI stood back as he hacked twenty to fifty pound chunk after chunk away from my silver bullet, as my brother Nick always used to call it, referring to a Coors Light can of cars. A fancy BMW tried to drive past just as the man was throwing chunks of ice into the road. The driver stopped just short of beeping, pressed on with unfriendly eyes, crunching over. \n\n“Ok, now let me have it,” I said. \n\nTogether, back and forth, we extricated my car. “I can’t believe you were here for this, dude. You gotta let me buy you a six-pack, or something. “Ok,” he said. \n\nWe walked up a side street and Paul, his name was, showed me apartments, now ultrasheen and fancified, which were once crack dens, drug nexuses, where people were shot on street corners, about the blizzard that took place in ‘94, or ‘04, or whenever it was, and dumped four feet and then melted in a day and a half, and no one remembered it--the blizzard that disappeared. \n\nWe arrived at the bodega when I remembered that I had no money. We walked two blocks to a bank that had an ATM. I removed $40, gave Paul twenty, and bought him four King Cobra malt liquors. He thanked me, saying, “Soon the TV will be watching me.” I returned home with two Cobras for myself, in what I felt was a casual and romantic dose of solidarity. One half of one made me feel as if I’d drank NyQuil, and I fell asleep dreaming of a Due Fratelli slice--a house favorite--with my lover Kristina’s face superimposed on the front of it. Nothing better.",
  "hidden": false,
  "date": "2019-08-13T02:07:00.000Z"
}