{
  "title": "Route 1",
  "body": "Driving late at night, in some instances, it’s like you might as well be anywhere on Earth. This illusion--that you are anywhere and nowhere in particular--requires the stars be few enough, and the setting is remote enough that nobody has bothered to construct street lamps. \n\nHere convenience stores are few and far between, and the pitch black hugs so close to the car windows as to bring about false womb recollections, or of the undersides of childhood bed covers, your mother’s armpit or boob. It is also none of these things. The dark road is a safety vessel, part of you and something of you, the light you make. It is a segment of perception, banal and ecstatic but real, and awe-inspiring. It is also a thing you must get through, no matter how bored or sleepy you are, before the forces of gravity and inertia allow you to return home. \n\nLast month I was in New Mexico, speeding along a highway that must have looked like a pencil line through the desert valley, the occasional rock shape blipping by as if we were speeding along the seafloor, and there I couldn’t see the vast open red hue on either side of me, pitch back like this night I drove into Maine, Route 1, with all my stuff packed, moving to the mid-coast, pine and birch forest on either side of me, or kelp forests if I had driven off into the ocean, again, and which I couldn’t see, either, all climes, all terrains, all images and times part of the same nebula, selfishly, recklessly a part of me, if only because encapsulated, if only for a split second by my poignant little fish-eyed view. \n\nI think I moved to Maine as part of a practical joke against myself. Against myself, and also for my own good. It took me 9 months to recognize that that thing I was doing before doing this, the partner, the job, the dog, the house I thought would go on forever, wouldn’t. In that time, we could have had a child, but instead we had failure. So, there I was, North, again, or for the first time--I couldn’t remember. \n\nI chose an area like where said partner and I had planned to live in perpetuity, somewhere in the woods, but in a hobbit hole, someone’s rented basement unlike the cabin of which we’d dreamed. It was as if I was going to live out one half of a fate I hoped would become whole again on its own. In the meantime, there I would write a weather report of sorts, starting with winter, of course, and for a job, I’d cook professionally, which of course was the one thing I said I’d never do again. \n\nHowever, according to the weather report, what I say rarely changes the course of reality--I only refer to that which I am capable--and I am incapable of mining the secrets of clouds. Furthermore, please note: your meteorologist is only loosely certified and rarely sober.",
  "hidden": false,
  "date": "2019-08-29T17:02:25.105Z"
}