{
  "title": "The Fable of The Potato Crazed Husband",
  "body": "There is talk of a potato crazed husband. Along the northwestern front, twenty miles inland and a few north of Camden, Rockport, the harbor where the restaurant is, I am standing in the kitchen cooking dinner with Ambria, Daniel and Craig. They are the primary colors of my social life in Maine, the restaurant staff notwithstanding, and I look forward to the end of each week, when we convene and get high and eat well and tend to their expansive gardens. The house and property, situated in what’s basically an elaborate clearing in the woods, are a sanctuary, but we all still live in the absurdity of needing wage jobs--none of us anywhere near willing to commit to anything salaried, or career-oriented--and having beautiful gardens and the capability to grow and raise enough food to survive, already casually having produced almost half of what we need, collectively, and thus doing both at the same time. Exhausting ourselves. Ambria works at a local farm I shall not name, an organic operation producing high quality produce for restaurants and local markets. This farm happens to be one of the main suppliers of the restaurant where I cook, and I can attest to the quality and variety of the produce, however they are a shining example of the classic--at this point--sustainable ag iteration, which row crops and suppresses weeds with square feet upon feet of black plastic tarp, rather than facilitating diverse plantings which are equally beneficial to the soil as to the yield, which outsources soil rather than structuring the operation in such a way that creates soil, and above all else which refuses to save seeds, leaving the varietal development to seed companies rather than selecting their own preferences. In my mind, the truest farmer uses good taste and sense to shepherd the genetics across time. I’ve heard these people say to my chef, lingering in the kitchen after a delivery, “I’ll tell you, you sometimes never know what you’re going to get with X Company. Once I brought in a green zebra variety and ended up with some brandywine/plum cross I’d never seen before.” While I’m not so picky about what I end up with, I can see the effects of the economics on these farmers, in their obsession with seeing crops through in perfect uniformity, in their refusal to be brave and let their gardens run wild with diverse growth and insects and pests, yes, but spiders to eat them, and decoy plantings to deter them. These people can’t afford not to make their money, because there is only so much to make. They would rather trust the expertise of a seed company, which may or may not fail or bait and switch them in some way, than devote time and resources to seed saving. Thus, even an ag operation which produces beautiful organic produce is wrapped around the coin. One of the owners of said operation, said potato-crazed husband, has a particular method of planting potatoes, involving a tilling method, spreading of outsourced fertilizer, cubing outsourced seed potatoes and planting those. The neurotic air of all this disturbed me to hear. He had banished his wife from working with them because he couldn’t handle the occasional fingernail marks in the skin, which were apparently her fault, or that they weren’t washed properly at some time or another, or the multitudes of blights and viruses the plants can incur. I’d imagine this is something deeper than money pressures, ensuring a successful yield, though needing a livelihood also permeates deep into the subconscious, spreading, sprouting. Banished was a strong word, and the story was certainly dramatized for humorous effect, as was this individual’s overall attitude toward his wife on the matter. But anyway, thus, the potato crazed husband was born. Another midcoast legend.",
  "hidden": false,
  "date": "2019-08-12T17:05:00.000Z"
}