{
  "title": "Upstairs neighbor weather report",
  "body": "There are certain dynamics which depersonalize us from one another, in a manner of speaking. \n\nOne is when we are driving in cars together on the road, separated from one another by the cars themselves. The other is living in proximity, though not with one another in the same residence, but above or below one another, in apartment buildings, in complexes or on city blocks. Road rage is a term that comes out of the first phenomenon, likely because it induces so much danger and so much mortality amnesia and all the rest. But I don’t think there is yet one for the second. \n\nEven as I deliver this report, the twelve-year-old daughter of my landlords stomps around like thunder overhead, my whole studio being basically a footprint of their living room. She drags something wooden, maybe a chair across the wood floor. I think of the ball-stringed thing you throw around the legs of your enemies to trip them, a bolas, I’ve learned it’s called, and how I want to toss one at young Scarlet and immobilize her so that I might put down some words during the meager last twenty-five minutes before my third 12-hour plug this week. The noise stops. I get going. The noise begins, again. Scattered showers of footprints, petulant energy--ok. \n\nLet’s face it. Scarlet is an adorable kid. Personable, kind, keeps her parents in check, practices the violin regularly, communes with animals with great ease and joy, such as pecking around with the ducks and chickens who live in a small backyard pasture, and rolling in the grass with the fat boy cat, Juju, who’s black and white like an orca whale and with hefty proportions, Juju who gets fed twice a day and sneaks chipmunks and birds in between. \n\nI once walked out in the morning to find the perfectly butchered hindquarter of a chipmunk, resting in some matted grass, saved for later. Point is, Scarlet is in every way un-hate-able, and yet when she is waking me up at 7am, after getting in at 1 or 2am, an ambient rage fills my brain and belly. \n\nI know what you’re thinking--buy some headphones, buy some earplugs, stop complaining. Perhaps you’re right. Although even with those things, you can still hear the bass note of the sole of a foot, the vibrations through the walls and floor, or ceiling--sometimes I get them backwards. \n\nI go outside, fed up, given up, for a trip to the garden, look around at the thousands of locust leaves fluttering in the wind, laced with salt, and remember the ocean isn’t far--something that falls out of mind, when the forest meets it. \n\nA gull flies overhead, and for the first time I think, God, what a beautiful creature. Furthermore, your meteorologist lacks the term for feeling incensed at your neighbors, who don’t realize how they fuck you with your footsteps. He is tired of naming things. \n\nA large cloud rolls in and blocks the sun. Not the foggiest of what’s to happen next.",
  "hidden": true,
  "date": "2019-08-15T17:08:00.000Z"
}